# GetFamilyInstanceId Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipeFittingAndAccessoryData..::..GetFamilyInstanceId Method
PipeFittingAndAccessoryData Class See Also
---
Gets the Id of the fiting or accessory instance
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId GetFamilyInstanceId()
```

Visual Basic
---
```text
Public Function GetFamilyInstanceId As ElementId
```

Visual C++
---
```text
public:
ElementId^ GetFamilyInstanceId()
```

# ### Return Value
The element Id of the fiting or accessory instance.
# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace